MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFG124/mcu.h
extern volatile __SBT7RD0bits_t SBT7RD0bits __asm__ ("SBT7RD0") __attribute__((section("sfrs"), address(0xBF8F9C50)));
#define SBT7WR0 SBT7WR0
extern volatile uint32_t   SBT7WR0 __attribute__((section("sfrs"), address(0xBF8F9C58)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7WR0bits_t;
extern volatile __SBT7WR0bits_t SBT7WR0bits __asm__ ("SBT7WR0") __attribute__((section("sfrs"), address(0xBF8F9C58)));
#define SBT7REG1 SBT7REG1
extern volatile uint32_t   SBT7REG1 __attribute__((section("sfrs"), address(0xBF8F9C60)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT7REG1bits_t;
extern volatile __SBT7REG1bits_t SBT7REG1bits __asm__ ("SBT7REG1") __attribute__((section("sfrs"), address(0xBF8F9C60)));
#define SBT7RD1 SBT7RD1
extern volatile uint32_t   SBT7RD1 __attribute__((section("sfrs"), address(0xBF8F9C70)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7RD1bits_t;
extern volatile __SBT7RD1bits_t SBT7RD1bits __asm__ ("SBT7RD1") __attribute__((section("sfrs"), address(0xBF8F9C70)));
#define SBT7WR1 SBT7WR1
extern volatile uint32_t   SBT7WR1 __attribute__((section("sfrs"), address(0xBF8F9C78)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7WR1bits_t;
extern volatile __SBT7WR1bits_t SBT7WR1bits __asm__ ("SBT7WR1") __attribute__((section("sfrs"), address(0xBF8F9C78)));
#define SBT8ELOG1 SBT8ELOG1
extern volatile uint32_t   SBT8ELOG1 __attribute__((section("sfrs"), address(0xBF8FA020)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT8ELOG1bits_t;
extern volatile __SBT8ELOG1bits_t SBT8ELOG1bits __asm__ ("SBT8ELOG1") __attribute__((section("sfrs"), address(0xBF8FA020)));
#define SBT8ELOG2 SBT8ELOG2
extern volatile uint32_t   SBT8ELOG2 __attribute__((section("sfrs"), address(0xBF8FA024)));
typedef struct {
  uint32_t GROUP:2;
} __SBT8ELOG2bits_t;
extern volatile __SBT8ELOG2bits_t SBT8ELOG2bits __asm__ ("SBT8ELOG2") __attribute__((section("sfrs"), address(0xBF8FA024)));
#define SBT8ECON SBT8ECON
extern volatile uint32_t   SBT8ECON __attribute__((section("sfrs"), address(0xBF8FA028)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT8ECONbits_t;
extern volatile __SBT8ECONbits_t SBT8ECONbits __asm__ ("SBT8ECON") __attribute__((section("sfrs"), address(0xBF8FA028)));
#define SBT8ECLRS SBT8ECLRS
extern volatile uint32_t   SBT8ECLRS __attribute__((section("sfrs"), address(0xBF8FA030)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT8ECLRSbits_t;
extern volatile __SBT8ECLRSbits_t SBT8ECLRSbits __asm__ ("SBT8ECLRS") __attribute__((section("sfrs"), address(0xBF8FA030)));
#define SBT8ECLRM SBT8ECLRM
extern volatile uint32_t   SBT8ECLRM __attribute__((section("sfrs"), address(0xBF8FA038)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT8ECLRMbits_t;
extern volatile __SBT8ECLRMbits_t SBT8ECLRMbits __asm__ ("SBT8ECLRM") __attribute__((section("sfrs"), address(0xBF8FA038)));
#define SBT8REG0 SBT8REG0
extern volatile uint32_t   SBT8REG0 __attribute__((section("sfrs"), address(0xBF8FA040)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT8REG0bits_t;
extern volatile __SBT8REG0bits_t SBT8REG0bits __asm__ ("SBT8REG0") __attribute__((section("sfrs"), address(0xBF8FA040)));
#define SBT8RD0 SBT8RD0
extern volatile uint32_t   SBT8RD0 __attribute__((section("sfrs"), address(0xBF8FA050)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8RD0bits_t;
extern volatile __SBT8RD0bits_t SBT8RD0bits __asm__ ("SBT8RD0") __attribute__((section("sfrs"), address(0xBF8FA050)));
#define SBT8WR0 SBT8WR0
extern volatile uint32_t   SBT8WR0 __attribute__((section("sfrs"), address(0xBF8FA058)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8WR0bits_t;
extern volatile __SBT8WR0bits_t SBT8WR0bits __asm__ ("SBT8WR0") __attribute__((section("sfrs"), address(0xBF8FA058)));
#define SBT8REG1 SBT8REG1
extern volatile uint32_t   SBT8REG1 __attribute__((section("sfrs"), address(0xBF8FA060)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT8REG1bits_t;
extern volatile __SBT8REG1bits_t SBT8REG1bits __asm__ ("SBT8REG1") __attribute__((section("sfrs"), address(0xBF8FA060)));
#define SBT8RD1 SBT8RD1
extern volatile uint32_t   SBT8RD1 __attribute__((section("sfrs"), address(0xBF8FA070)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8RD1bits_t;
extern volatile __SBT8RD1bits_t SBT8RD1bits __asm__ ("SBT8RD1") __attribute__((section("sfrs"), address(0xBF8FA070)));
#define SBT8WR1 SBT8WR1
extern volatile uint32_t   SBT8WR1 __attribute__((section("sfrs"), address(0xBF8FA078)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8WR1bits_t;
extern volatile __SBT8WR1bits_t SBT8WR1bits __asm__ ("SBT8WR1") __attribute__((section("sfrs"), address(0xBF8FA078)));
#define SBT9ELOG1 SBT9ELOG1
extern volatile uint32_t   SBT9ELOG1 __attribute__((section("sfrs"), address(0xBF8FA420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT9ELOG1bits_t;
extern volatile __SBT9ELOG1bits_t SBT9ELOG1bits __asm__ ("SBT9ELOG1") __attribute__((section("sfrs"), address(0xBF8FA420)));
#define SBT9ELOG2 SBT9ELOG2
extern volatile uint32_t   SBT9ELOG2 __attribute__((section("sfrs"), address(0xBF8FA424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT9ELOG2bits_t;
extern volatile __SBT9ELOG2bits_t SBT9ELOG2bits __asm__ ("SBT9ELOG2") __attribute__((section("sfrs"), address(0xBF8FA424)));
#define SBT9ECON SBT9ECON
extern volatile uint32_t   SBT9ECON __attribute__((section("sfrs"), address(0xBF8FA428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT9ECONbits_t;
extern volatile __SBT9ECONbits_t SBT9ECONbits __asm__ ("SBT9ECON") __attribute__((section("sfrs"), address(0xBF8FA428)));
#define SBT9ECLRS SBT9ECLRS
extern volatile uint32_t   SBT9ECLRS __attribute__((section("sfrs"), address(0xBF8FA430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT9ECLRSbits_t;
extern volatile __SBT9ECLRSbits_t SBT9ECLRSbits __asm__ ("SBT9ECLRS") __attribute__((section("sfrs"), address(0xBF8FA430)));
#define SBT9ECLRM SBT9ECLRM
extern volatile uint32_t   SBT9ECLRM __attribute__((section("sfrs"), address(0xBF8FA438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT9ECLRMbits_t;
extern volatile __SBT9ECLRMbits_t SBT9ECLRMbits __asm__ ("SBT9ECLRM") __attribute__((section("sfrs"), address(0xBF8FA438)));
#define SBT9REG0 SBT9REG0
extern volatile uint32_t   SBT9REG0 __attribute__((section("sfrs"), address(0xBF8FA440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT9REG0bits_t;
extern volatile __SBT9REG0bits_t SBT9REG0bits __asm__ ("SBT9REG0") __attribute__((section("sfrs"), address(0xBF8FA440)));
#define SBT9RD0 SBT9RD0
extern volatile uint32_t   SBT9RD0 __attribute__((section("sfrs"), address(0xBF8FA450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9RD0bits_t;
